quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Что такое список в Python?',
        'options': ['Неупорядоченная коллекция', 'Упорядоченная коллекция', 'Функция', 'Тип данных'],
        'correct_option': 1
    },
    {
        'question': 'Какой оператор используется для сравнения двух значений?',
        'options': ['=', '==', '===', '!='],
        'correct_option': 1
    },
    {
        'question': 'Что такое функция в Python?',
        'options': ['Блок кода', 'Переменная', 'Класс', 'Модуль'],
        'correct_option': 0
    },
    {
        'question': 'Какой метод используется для добавления элемента в список?',
        'options': ['add()', 'append()', 'insert()', 'extend()'],
        'correct_option': 1
    },
    {
        'question': 'Какой из следующих типов данных является неизменяемым?',
        'options': ['список', 'словарь', 'кортеж', 'множество'],
        'correct_option': 2
    },
    {
        'question': 'Какой оператор используется для логического И?',
        'options': ['&', '|', 'and', 'or'],
        'correct_option': 2
    },
    {
        'question': 'Что такое словарь в Python?',
        'options': ['Неупорядоченная коллекция пар ключ-значение', 'Упорядоченная коллекция', 'Функция', 'Тип данных'],
        'correct_option': 0
    },
    {
        'question': 'Как объявить переменную в Python?',
        'options': ['var x = 5', 'let x = 5', 'x = 5', 'x : 5'],
        'correct_option': 2
    }
]